LiteOS/LiteOS/targets/STM32L476RGTx_Six_Square/Src/uds_gpio.c
#include "stm32l4xx_hal.h"
#include "uds/uds.h"
#include "uds/uds_dev.h"
#include "uds/uds_gpio.h"
#include "stdio.h"

extern void free(void *ptr);
extern void *malloc(size_t size);



struct gpio_device_s
{
    uds_gpio_init_t        gpio_init;
    uds_gpio_cmd           iotype;


};
typedef struct gpio_device_s gpio_device_t;



GPIO_InitTypeDef GPIO_InitStruct;



/**
  * @brief  set an output pin to be high level.
  * @param  gpio_init_t *gpio : initialize paremeters list.
  * @retval -1:input parameters error 
  * @retval  0:success
  */
s32_t uds_gpio_set_output_pin(gpio_device_t *device)
{
    switch (device->gpio_init.gpio_port_num)
    {
        case UDS_GPIO_A:
            HAL_GPIO_WritePin(GPIOA, (1<<(device->gpio_init.gpio_pin_num)), GPIO_PIN_SET);
            break;
        case UDS_GPIO_B:
            HAL_GPIO_WritePin(GPIOB, (1<<(device->gpio_init.gpio_pin_num)), GPIO_PIN_SET);
            break;
        case UDS_GPIO_C:
            HAL_GPIO_WritePin(GPIOC, (1<<(device->gpio_init.gpio_pin_num)), GPIO_PIN_SET);
            break;
        case UDS_GPIO_D:
            HAL_GPIO_WritePin(GPIOD, (1<<(device->gpio_init.gpio_pin_num)), GPIO_PIN_SET);
            break;
        case UDS_GPIO_E:
            HAL_GPIO_WritePin(GPIOE, (1<<(device->gpio_init.gpio_pin_num)), GPIO_PIN_SET);
            break;
        case UDS_GPIO_F:
            HAL_GPIO_WritePin(GPIOF, (1<<(device->gpio_init.gpio_pin_num)), GPIO_PIN_SET);
            break;
        case UDS_GPIO_G:
            HAL_GPIO_WritePin(GPIOG, (1<<(device->gpio_init.gpio_pin_num)), GPIO_PIN_SET);
            break;
        case UDS_GPIO_H:
            HAL_GPIO_WritePin(GPIOH, (1<<(device->gpio_init.gpio_pin_num)), GPIO_PIN_SET);
            break;
        default:
            return -UDS_ERROR;
     }
    return UDS_OK;
 
}




/**
  * @brief  set an output pin to be low level.
  * @param  gpio_init_t *gpio : initialize paremeters list.
  * @retval -1:input parameters error 
  * @retval  1:success
  */
s32_t uds_gpio_clear_output_pin(gpio_device_t *device)
{
    switch (device->gpio_init.gpio_port_num)
    {
        case UDS_GPIO_A:
            HAL_GPIO_WritePin(GPIOA, (1<<(device->gpio_init.gpio_pin_num)), GPIO_PIN_RESET);
            break;
        case UDS_GPIO_B:
            HAL_GPIO_WritePin(GPIOB, (1<<(device->gpio_init.gpio_pin_num)), GPIO_PIN_RESET);
            break;
        case UDS_GPIO_C:
            HAL_GPIO_WritePin(GPIOC, (1<<(device->gpio_init.gpio_pin_num)), GPIO_PIN_RESET);
            break;
        case UDS_GPIO_D:
            HAL_GPIO_WritePin(GPIOD, (1<<(device->gpio_init.gpio_pin_num)), GPIO_PIN_RESET);
            break;
        case UDS_GPIO_E:
            HAL_GPIO_WritePin(GPIOE, (1<<(device->gpio_init.gpio_pin_num)), GPIO_PIN_RESET);
            break;
        case UDS_GPIO_F:
            HAL_GPIO_WritePin(GPIOF, (1<<(device->gpio_init.gpio_pin_num)), GPIO_PIN_RESET);
            break;
        case UDS_GPIO_G:
            HAL_GPIO_WritePin(GPIOG, (1<<(device->gpio_init.gpio_pin_num)), GPIO_PIN_RESET);
            break;
        case UDS_GPIO_H:
            HAL_GPIO_WritePin(GPIOH, (1<<(device->gpio_init.gpio_pin_num)), GPIO_PIN_RESET);
            break;
        default:
            return -UDS_ERROR;
    }  
    return UDS_OK;
}

/**
  * @brief  toggle pin level.
  * @param  gpio_init_t *gpio : initialize paremeters list.
  * @retval -1:input parameters error 
  * @retval 1:success
  */
s32_t uds_gpio_toggle_output_pin(gpio_device_t *device)
{
    switch (device->gpio_init.gpio_port_num)
    {
        case UDS_GPIO_A:
            HAL_GPIO_TogglePin(GPIOA, (1<<(device->gpio_init.gpio_pin_num)));
            break;
        case UDS_GPIO_B:
            HAL_GPIO_TogglePin(GPIOB, (1<<(device->gpio_init.gpio_pin_num)));
            break;
        case UDS_GPIO_C:
            HAL_GPIO_TogglePin(GPIOC, (1<<(device->gpio_init.gpio_pin_num)));
            break;
        case UDS_GPIO_D:
            HAL_GPIO_TogglePin(GPIOD, (1<<(device->gpio_init.gpio_pin_num)));
            break;
        case UDS_GPIO_E:
            HAL_GPIO_TogglePin(GPIOE, (1<<(device->gpio_init.gpio_pin_num)));
            break;
        case UDS_GPIO_F:
            HAL_GPIO_TogglePin(GPIOF, (1<<(device->gpio_init.gpio_pin_num)));
            break;
        case UDS_GPIO_G:
            HAL_GPIO_TogglePin(GPIOG, (1<<(device->gpio_init.gpio_pin_num)));
            break;
        case UDS_GPIO_H:
            HAL_GPIO_TogglePin(GPIOH, (1<<(device->gpio_init.gpio_pin_num)));
            break;
        default:
            return -UDS_ERROR;
    }  
    return UDS_OK;
}

/**
  * @brief  read the level of the input pin.
  * @param  gpio_init_t *gpio : initialize paremeters list.
  * @retval 0:low level
  * @retval 1:high level
  * @retval -1:input parameters error
  */
s32_t uds_gpio_read_input_pin(gpio_device_t *device, u8_t *data)
{
   // s32_t ret;
    switch (device->gpio_init.gpio_port_num)
    {
        case UDS_GPIO_A:
           *data = HAL_GPIO_ReadPin(GPIOA, (1<<(device->gpio_init.gpio_pin_num)));
           return UDS_OK;
        case UDS_GPIO_B:
           *data = HAL_GPIO_ReadPin(GPIOB, (1<<(device->gpio_init.gpio_pin_num)));
           return UDS_OK;
        case UDS_GPIO_C:
           *data = HAL_GPIO_ReadPin(GPIOC, (1<<(device->gpio_init.gpio_pin_num)));
           return UDS_OK;
        case UDS_GPIO_D:
           *data = HAL_GPIO_ReadPin(GPIOD, (1<<(device->gpio_init.gpio_pin_num)));
           return UDS_OK;
        case UDS_GPIO_E:
           *data = HAL_GPIO_ReadPin(GPIOE, (1<<(device->gpio_init.gpio_pin_num)));
           return UDS_OK;
        case UDS_GPIO_F:
           *data = HAL_GPIO_ReadPin(GPIOF, (1<<(device->gpio_init.gpio_pin_num)));
           return UDS_OK;
        case UDS_GPIO_G:
           *data = HAL_GPIO_ReadPin(GPIOG, (1<<(device->gpio_init.gpio_pin_num)));
           return UDS_OK;
        case UDS_GPIO_H:
           *data = HAL_GPIO_ReadPin(GPIOH, (1<<(device->gpio_init.gpio_pin_num)));
           return UDS_OK;
        default:
           return -UDS_ERROR;
    }
	
