LiteOS/LiteOS/targets/STM32L476RGTx_Six_Square/Src/uds_gpio.c
}

/**
  * @brief  Read the specified input port pin.
  * @param  GPIOx: where x can be (A..H) to select the GPIO peripheral for STM32L4 family
  * @param  GPIO_Pin: specifies the port bit to read.
  *         This parameter can be any combination of GPIO_Pin_x where x can be (0..15).
  * @retval The input port pin value.
  */
GPIO_PinState HAL_GPIO_ReadOutputPin(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin)
{
    GPIO_PinState bitstatus;

    /* Check the parameters */
    assert_param(IS_GPIO_PIN(GPIO_Pin));

    if ((GPIOx->ODR & GPIO_Pin) != 0x00u)
    {
        bitstatus = GPIO_PIN_SET;
    }
    else
    {
        bitstatus = GPIO_PIN_RESET;
    }
    return bitstatus;
}
/**
  * @brief  read the level of the output pin.
  * @param  gpio_init_t *gpio : initialize paremeters list.
  * @retval 0:low level
  * @retval 1:high level
  * @retval -1:input parameters error
  */
s32_t uds_gpio_read_output_pin(gpio_device_t *device,u8_t *data)
{
    // s32_t ret;
    switch (device->gpio_init.gpio_port_num)
    {
        case UDS_GPIO_A:
           *data = HAL_GPIO_ReadOutputPin(GPIOA, (1<<(device->gpio_init.gpio_pin_num)));
           return UDS_OK;
        case UDS_GPIO_B:
           *data = HAL_GPIO_ReadOutputPin(GPIOB, (1<<(device->gpio_init.gpio_pin_num)));
           return UDS_OK;
        case UDS_GPIO_C:
           *data = HAL_GPIO_ReadOutputPin(GPIOC, (1<<(device->gpio_init.gpio_pin_num)));
           return UDS_OK;
        case UDS_GPIO_D:
           *data = HAL_GPIO_ReadOutputPin(GPIOD, (1<<(device->gpio_init.gpio_pin_num)));
           return UDS_OK;
        case UDS_GPIO_E:
           *data = HAL_GPIO_ReadOutputPin(GPIOE, (1<<(device->gpio_init.gpio_pin_num)));
           return UDS_OK;
        case UDS_GPIO_F:
           *data = HAL_GPIO_ReadOutputPin(GPIOF, (1<<(device->gpio_init.gpio_pin_num)));
           return UDS_OK;
        case UDS_GPIO_G:
           *data = HAL_GPIO_ReadOutputPin(GPIOG, (1<<(device->gpio_init.gpio_pin_num)));
           return UDS_OK;
        case UDS_GPIO_H:
           *data = HAL_GPIO_ReadOutputPin(GPIOH, (1<<(device->gpio_init.gpio_pin_num)));
           return UDS_OK;
        default:
           return -UDS_ERROR;
    }

}


s32_t uds_gpio_set_input(gpio_device_t *device)
{
    gpio_device_t *device_init = (gpio_device_t *)device;
    device_init->gpio_init.gpio_mode = UDS_GPIO_INPUT;
    
    
    GPIO_InitStruct.Pin = 1<<(device_init->gpio_init.gpio_pin_num);
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Speed = device_init->gpio_init.gpio_speed;
    
    switch (device_init->gpio_init.gpio_port_num)
    {
        case UDS_GPIO_A:
            __HAL_RCC_GPIOA_CLK_ENABLE();
            HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
            break;
        case UDS_GPIO_B:
            __HAL_RCC_GPIOB_CLK_ENABLE();
            HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
            break;
      case UDS_GPIO_C:
            __HAL_RCC_GPIOC_CLK_ENABLE();
            HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
            break;
        case UDS_GPIO_D:
            __HAL_RCC_GPIOD_CLK_ENABLE();
            HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);
            break;
        case UDS_GPIO_E:
            __HAL_RCC_GPIOE_CLK_ENABLE();
            HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);
            break;
        case UDS_GPIO_F:
            __HAL_RCC_GPIOF_CLK_ENABLE();
            HAL_GPIO_Init(GPIOF, &GPIO_InitStruct);
            break;
        case UDS_GPIO_G:
            __HAL_RCC_GPIOG_CLK_ENABLE();
            HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);
            break;
        case UDS_GPIO_H:
            __HAL_RCC_GPIOH_CLK_ENABLE();
            HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);
            break;
        default:
            return -UDS_ERROR;
    }

        return UDS_OK;
}

s32_t uds_gpio_set_output(gpio_device_t *device)
{
    gpio_device_t *device_init = (gpio_device_t *)device;
    
    device_init->gpio_init.gpio_mode = UDS_GPIO_OUTPUT_PP;
    GPIO_InitStruct.Pin = 1<<(device_init->gpio_init.gpio_pin_num);
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = device_init->gpio_init.gpio_pull;
    GPIO_InitStruct.Speed = device_init->gpio_init.gpio_speed;
    
    switch (device_init->gpio_init.gpio_port_num)
    {
        case UDS_GPIO_A:
            __HAL_RCC_GPIOA_CLK_ENABLE();
            HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
            break;
        case UDS_GPIO_B:
            __HAL_RCC_GPIOB_CLK_ENABLE();
            HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
            break;
        case UDS_GPIO_C:
            __HAL_RCC_GPIOC_CLK_ENABLE();
            HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
            break;
        case UDS_GPIO_D:
            __HAL_RCC_GPIOD_CLK_ENABLE();
            HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);
            break;
        case UDS_GPIO_E:
            __HAL_RCC_GPIOE_CLK_ENABLE();
            HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);
            break;
        case UDS_GPIO_F:
            __HAL_RCC_GPIOF_CLK_ENABLE();
            HAL_GPIO_Init(GPIOF, &GPIO_InitStruct);
            break;
        case UDS_GPIO_G:
            __HAL_RCC_GPIOG_CLK_ENABLE();
            HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);
            break;
        case UDS_GPIO_H:
            __HAL_RCC_GPIOH_CLK_ENABLE();
            HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);
            break;
        default:
            return -UDS_ERROR;
    }

        return UDS_OK;

}

static bool_t uds_gpio_open(void *pri, s32_t flag)
{
    return UDS_OK;
}


/**
* @brief  deInitialize the i2c device.
* @param  
* @retval 1:success
          0:fail
*/
static void uds_gpio_close(void *pri)
{
    
}


/**
  * @brief  initialize the GPIO peripheral according to the specified parameters in the gpio.
  * @param  gpio_init_t *gpio : initialize paremeters list.
    * @retval -1:input parameters error 
    * @retval   0:success
                    
*/


static bool_t uds_gpio_init(void *pri)
{
    volatile s32_t ret;
    uint32_t mode;
    gpio_device_t *device_init = (gpio_device_t *)pri;

    

    switch(device_init->gpio_init.gpio_mode)
    {
        case UDS_GPIO_INPUT:
            mode = GPIO_MODE_INPUT;
            break;
        case UDS_GPIO_OUTPUT_PP:
            mode = GPIO_MODE_OUTPUT_PP;
            break;
        case UDS_GPIO_OUTPUT_OD:
            mode = GPIO_MODE_OUTPUT_OD;
            break;
        case UDS_GPIO_IT_FALLING:
            mode = GPIO_MODE_IT_FALLING;
            break;
        case UDS_GPIO_IT_RISING:
            mode = GPIO_MODE_IT_RISING;
            break;
        case UDS_GPIO_IT_RISING_FALLING:
            mode = GPIO_MODE_IT_RISING_FALLING;
            break;
        default:
            return -UDS_ERROR;
    
