LiteOS/LiteOS/targets/STM32L476RGTx_Six_Square/Src/uds_gpio.c
    }
    switch (device_init->gpio_init.gpio_port_num)
    {
        
        case UDS_GPIO_A:
            __HAL_RCC_GPIOA_CLK_ENABLE();
    
            GPIO_InitStruct.Pin = 1<<(device_init->gpio_init.gpio_pin_num);
            GPIO_InitStruct.Mode = mode;
            GPIO_InitStruct.Pull = device_init->gpio_init.gpio_pull;
            GPIO_InitStruct.Speed = device_init->gpio_init.gpio_speed;
            
            HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
            break;
        case UDS_GPIO_B:
            __HAL_RCC_GPIOB_CLK_ENABLE();
    
            GPIO_InitStruct.Pin = 1<<(device_init->gpio_init.gpio_pin_num);
            GPIO_InitStruct.Mode = mode;
            GPIO_InitStruct.Pull = device_init->gpio_init.gpio_pull;
            GPIO_InitStruct.Speed = device_init->gpio_init.gpio_speed;
    
            HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
            break;
      case UDS_GPIO_C:
            __HAL_RCC_GPIOC_CLK_ENABLE();
    
            GPIO_InitStruct.Pin = 1<<(device_init->gpio_init.gpio_pin_num);
            GPIO_InitStruct.Mode = mode;
            GPIO_InitStruct.Pull = device_init->gpio_init.gpio_pull;
            GPIO_InitStruct.Speed = device_init->gpio_init.gpio_speed;
    
            HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
            break;
        case UDS_GPIO_D:
            __HAL_RCC_GPIOD_CLK_ENABLE();
    
            GPIO_InitStruct.Pin = 1<<(device_init->gpio_init.gpio_pin_num);
            GPIO_InitStruct.Mode = mode;
            GPIO_InitStruct.Pull = device_init->gpio_init.gpio_pull;
            GPIO_InitStruct.Speed = device_init->gpio_init.gpio_speed;
    
            HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);
            break;
        case UDS_GPIO_E:
            __HAL_RCC_GPIOE_CLK_ENABLE();
    
            GPIO_InitStruct.Pin = 1<<(device_init->gpio_init.gpio_pin_num);
            GPIO_InitStruct.Mode = mode;
            GPIO_InitStruct.Pull = device_init->gpio_init.gpio_pull;
            GPIO_InitStruct.Speed = device_init->gpio_init.gpio_speed;
    
            HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);
            break;
        case UDS_GPIO_F:
            __HAL_RCC_GPIOF_CLK_ENABLE();
    
            GPIO_InitStruct.Pin = 1<<(device_init->gpio_init.gpio_pin_num);
            GPIO_InitStruct.Mode = mode;
            GPIO_InitStruct.Pull = device_init->gpio_init.gpio_pull;
            GPIO_InitStruct.Speed = device_init->gpio_init.gpio_speed;
    
            HAL_GPIO_Init(GPIOF, &GPIO_InitStruct);
            break;
        case UDS_GPIO_G:
            __HAL_RCC_GPIOG_CLK_ENABLE();
    
            GPIO_InitStruct.Pin = 1<<(device_init->gpio_init.gpio_pin_num);
            GPIO_InitStruct.Mode = mode;
            GPIO_InitStruct.Pull = device_init->gpio_init.gpio_pull;
            GPIO_InitStruct.Speed = device_init->gpio_init.gpio_speed;
    
            HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);
            break;
        case UDS_GPIO_H:
            __HAL_RCC_GPIOH_CLK_ENABLE();
    
            GPIO_InitStruct.Pin = 1<<(device_init->gpio_init.gpio_pin_num);
            GPIO_InitStruct.Mode = mode;
            GPIO_InitStruct.Pull = device_init->gpio_init.gpio_pull;
            GPIO_InitStruct.Speed = device_init->gpio_init.gpio_speed;
    
            HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);
            break;
        default:
            return -UDS_ERROR;
              
    }
    if(device_init->gpio_init.gpio_mode >= 3)
        {
            switch (device_init->gpio_init.gpio_pin_num)
            {
                case 0:
                    HAL_NVIC_SetPriority(EXTI0_IRQn, device_init->gpio_init.uds_PreemptionPriority, device_init->gpio_init.uds_SubPriority);
                    HAL_NVIC_EnableIRQ(EXTI0_IRQn);
                    break;
              case 1:
                    HAL_NVIC_SetPriority(EXTI1_IRQn, device_init->gpio_init.uds_PreemptionPriority, device_init->gpio_init.uds_SubPriority);
                    HAL_NVIC_EnableIRQ(EXTI1_IRQn);
                    break;
                case 2:
                    HAL_NVIC_SetPriority(EXTI2_IRQn, device_init->gpio_init.uds_PreemptionPriority, device_init->gpio_init.uds_SubPriority);
                    HAL_NVIC_EnableIRQ(EXTI2_IRQn);
                    break;
                case 3:
                    HAL_NVIC_SetPriority(EXTI3_IRQn, device_init->gpio_init.uds_PreemptionPriority, device_init->gpio_init.uds_SubPriority);
                    HAL_NVIC_EnableIRQ(EXTI3_IRQn);
                    break;
                case 4:
                    HAL_NVIC_SetPriority(EXTI4_IRQn, device_init->gpio_init.uds_PreemptionPriority, device_init->gpio_init.uds_SubPriority);
                    HAL_NVIC_EnableIRQ(EXTI4_IRQn);
                    break;
                case 5:
                case 6:
                case 7:
                case 8:
                case 9:
                    HAL_NVIC_SetPriority(EXTI9_5_IRQn, device_init->gpio_init.uds_PreemptionPriority, device_init->gpio_init.uds_SubPriority);
                    HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);
                    break;
                case 10:
                case 11:
                case 12:
                case 13:
                case 14:
                case 15:
                    HAL_NVIC_SetPriority(EXTI15_10_IRQn, device_init->gpio_init.uds_PreemptionPriority, device_init->gpio_init.uds_SubPriority);
                    HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);
                    break;
                default:
                    return -UDS_ERROR;
            }
        }
        return UDS_OK;
}



static void uds_gpio_deinit(void *pri)
{
    gpio_device_t *device_deinit = (gpio_device_t *)pri;
    switch (device_deinit->gpio_init.gpio_port_num)
    {
        case UDS_GPIO_A:
            HAL_GPIO_DeInit(GPIOA, (1<<(device_deinit->gpio_init.gpio_pin_num)));
            break;
        case UDS_GPIO_B:
            HAL_GPIO_DeInit(GPIOB, (1<<(device_deinit->gpio_init.gpio_pin_num)));
            break;
        case UDS_GPIO_C:
            HAL_GPIO_DeInit(GPIOC, (1<<(device_deinit->gpio_init.gpio_pin_num)));
            break;
        case UDS_GPIO_D:
            HAL_GPIO_DeInit(GPIOD, (1<<(device_deinit->gpio_init.gpio_pin_num)));
            break;
        case UDS_GPIO_E:
            HAL_GPIO_DeInit(GPIOE, (1<<(device_deinit->gpio_init.gpio_pin_num)));
            break;
        case UDS_GPIO_F:
            HAL_GPIO_DeInit(GPIOF, (1<<(device_deinit->gpio_init.gpio_pin_num)));
            break;
        case UDS_GPIO_G:
            HAL_GPIO_DeInit(GPIOG, (1<<(device_deinit->gpio_init.gpio_pin_num)));
            break;
        case UDS_GPIO_H:
            HAL_GPIO_DeInit(GPIOH, (1<<(device_deinit->gpio_init.gpio_pin_num)));
            break;
        default:
            break;
    }
    free(device_deinit);
}


static s32_t uds_gpio_read(void *pri,u32_t offset,u8_t *buf,s32_t len,u32_t timeout)
{
    s32_t result = 0;
    gpio_device_t *device = (gpio_device_t *)pri;
    (void)offset;
    switch(device->gpio_init.gpio_mode)
    {
        case UDS_GPIO_INPUT:
        case UDS_GPIO_IT_RISING:
        case UDS_GPIO_IT_FALLING:
        case UDS_GPIO_IT_RISING_FALLING:
            result = uds_gpio_read_input_pin(device,buf);
            break;
        case UDS_GPIO_OUTPUT_PP:
        case UDS_GPIO_OUTPUT_OD:
            result = uds_gpio_read_output_pin(device,buf);
            break;
        default:
            return -UDS_ERROR;
    }
    return 1;
}

static s32_t  uds_gpio_write(void *pri,u32_t offset,u8_t *buf,s32_t len,u32_t timeout)
{
	bool_t result = UDS_OK;
    gpio_device_t *device = (gpio_device_t *)pri; 
    switch(*buf)
    {
       
        case 0:
            result = uds_gpio_clear_output_pin(device);
            return UDS_OK; 
		case 1:
            result = uds_gpio_set_output_pin(device);
            return UDS_OK;
		default:
			return -UDS_ERROR;
	}  
}

