LiteOS/LiteOS/targets/STM32L476RGTx_Six_Square/Src/uds_gpio.c
typedef void (*gpio_callback_fun)(uint16_t);
gpio_callback_fun gpio_user_callback;

s32_t uds_gpio_set_exit_callback(gpio_device_t *device,gpio_callback_fun para)
{
    gpio_user_callback = para;
    return UDS_OK;
}


static bool_t uds_gpio_ioctl(void *pri,u32_t cmd, void *para,s32_t len)
{
    bool_t result = UDS_OK;
    gpio_device_t *device = (gpio_device_t *)pri; 
    switch(cmd)
    {
        case UDS_GPIO_TOGGLE_PIN:
            result = uds_gpio_toggle_output_pin(device);
            break;   
		case UDS_GPIO_SET_OUTPUT:
            result = uds_gpio_set_output(device);
            break;   
		case UDS_GPIO_SET_INPUT:
            result = uds_gpio_set_input(device);
            break;   
        case UDS_GPIO_SET_EXITCALLBACK:
            result = uds_gpio_set_exit_callback(device,(gpio_callback_fun)para);
            break;
        default:
            result = -UDS_ERROR;
        break;
    }
    return result;
}


static uds_driv_op_t uds_opt = {
    .open     = uds_gpio_open,
    .close    = uds_gpio_close,
    .read     = uds_gpio_read,
    .write    = uds_gpio_write,
    .ioctl    = uds_gpio_ioctl,
    .init     = uds_gpio_init,
    .deinit   = uds_gpio_deinit,
};

bool_t uds_gpio_dev_install(const char *name, void *pri)
{
    gpio_device_t *device = (gpio_device_t *)malloc(sizeof(gpio_device_t));
    memset(device, 0, sizeof(gpio_device_t));

    memcpy(&device->gpio_init,pri,sizeof(uds_gpio_init_t));
    if(!uds_driv_register(name,&uds_opt,device,0))
    {
        return -UDS_ERROR;
    }
    return UDS_OK;
}




void uds_exti_callback(uint16_t GPIO_Pin)
{
    
    gpio_user_callback(GPIO_Pin);
}

void EXTI0_IRQHandler(void)
{
    if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_0) != RESET)
    {
        __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_0);
        uds_exti_callback(GPIO_PIN_0);
    }
}


void EXTI1_IRQHandler(void)
{
    if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_1) != RESET)
    {
        __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_1);
        uds_exti_callback(GPIO_PIN_1);
    }
}


void EXTI2_IRQHandler(void)
{
    if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_2) != RESET)
    {
        __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_2);
        uds_exti_callback(GPIO_PIN_2);
    }
}
void EXTI3_IRQHandler(void)
{
    if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_3) != RESET)
    {
        __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_3);
        uds_exti_callback(GPIO_PIN_3);
    }
}
void EXTI4_IRQHandler(void)
{
    if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_4) != RESET)
    {
        __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_4);
        uds_exti_callback(GPIO_PIN_4);
    }
}
void EXTI9_5_IRQHandler(void)
{
    if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_5) != RESET)
    {
        __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_5);
        uds_exti_callback(GPIO_PIN_5);
    }
    else if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_6) != RESET)
    {
        __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_6);
        uds_exti_callback(GPIO_PIN_6);
    }
    else if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_7) != RESET)
    {
        __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_7);
        uds_exti_callback(GPIO_PIN_7);
    }
    else if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_8) != RESET)
    {
        __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_8);
        uds_exti_callback(GPIO_PIN_8);
    }
    else if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_9) != RESET)
    {
        __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_9);
        uds_exti_callback(GPIO_PIN_9);
    }
}
void EXTI15_10_IRQHandler(void)
{
    if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_10) != RESET)
    {
        __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_10);
        uds_exti_callback(GPIO_PIN_10);
    }
    if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_11) != RESET)
    {
        __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_11);
        uds_exti_callback(GPIO_PIN_11);
    }
    if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_12) != RESET)
    {
        __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_12);
        uds_exti_callback(GPIO_PIN_12);
    }
    if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_13) != RESET)
    {
        __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_13);
        uds_exti_callback(GPIO_PIN_13);
    }
    if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_14) != RESET)
    {
        __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_14);
        uds_exti_callback(GPIO_PIN_14);
    }
    if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_15) != RESET)
    {
        __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_15);
        uds_exti_callback(GPIO_PIN_15);
    }
}



